// Типы vs интерфейсы
// Type
//     Можно описывать примитивы и объекты.
//     При union and intersection types не кэшируется
//     Менее вменяемые сообщения об ошибках (вычисляет тип при пересечении или объединении шаг за шагом)
//     Не поддерживается Declaration merging
// Interface
// Можно описывать только объекты
// При union and intersection types  кэшируется
// Более вменяемые сообщения об ошибках (строит интерфейс сразу и можно увидеть недостающие поля в одной ошибке)
// Поддерживается Declaration merging
